Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = false
                              + expr         = "round(sum(increase(podVolume_data_download_failure_total{node=~\"$fsb_node\"}[1h])))"
                              + instant      = false
                              + interval     = ""
                              + legendFormat = "Data download failure"
                              + refId        = "E"
                            },
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = true
                              + expr         = "round(sum(increase(podVolume_data_upload_cancel_total{node=~\"$fsb_node\"}[1h])))"
                              + hide         = false
                              + interval     = ""
                              + legendFormat = "Data download cancel"
                              + refId        = "F"
                            },
                        ]
                      + title         = "CSI Snapshot Data Mover per hour"
                      + type          = "timeseries"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 39
              + tags                 = [
                  + "velero",
                ]
              + templating           = {
                  + list = [
                      + {
                          + current     = {
                              + selected = false
                              + text     = "grafanacloud-dfdsdemo-prom"
                              + value    = "grafanacloud-prom"
                            }
                          + hide        = 0
                          + includeAll  = false
                          + label       = "Datasource"
                          + multi       = false
                          + name        = "datasource"
                          + options     = []
                          + query       = "prometheus"
                          + queryValue  = ""
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + type        = "datasource"
                        },
                      + {
                          + current        = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource     = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition     = "label_values(velero_backup_attempt_total, schedule)"
                          + hide           = 0
                          + includeAll     = true
                          + multi          = true
                          + name           = "schedule"
                          + options        = []
                          + query          = {
                              + query = "label_values(velero_backup_attempt_total, schedule)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(velero_csi_snapshot_attempt_total, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "csi_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(velero_csi_snapshot_attempt_total, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_pod_volume_backup_enqueue_count, node)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_node"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_pod_volume_backup_enqueue_count, node)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, operation)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_operation"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, operation)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, pod_volume_backup)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_pvb_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, pod_volume_backup)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_backup_enqueue_count, node)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_node"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_backup_enqueue_count, node)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, operation)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_operation"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, operation)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, pod_volume_backup)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_pvb_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, pod_volume_backup)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                    ]
                }
              + time                 = {
                  + from = "now-2d"
                  + to   = "now"
                }
              + timepicker           = {
                  + hidden            = false
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                }
              + timezone             = ""
              + title                = "Kubernetes/Tanzu/Velero"
              + uid                  = "YAniUGC"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + overwrite    = true
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/1password-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/1password-scimbridge.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/aws-backup-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/aws-cni-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/aws-subnet-usage.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/blueprints-rds-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/cloud-engineering-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/cluster-capacity.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/cluster-health.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/ec2-credits.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/eks-version.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/flux-cluster-stats.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/flux-control-plane.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/goldpinger.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/helm-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/kafka-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/kiosk.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/kubernetes-components.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/liveness-readiness-for-namespace.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/liveness-readiness.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/node-condition.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/node-sockets-used.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/priorityclass.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/prometheus-blackbox-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/selfservice-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/selfservice-rds-tagging-compliance.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/traefik-blue-green.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/traefik-integration.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards.grafana_dashboard_permission.this["dashboards/velero.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "1password"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-1Password"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "awsbackupobservability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://aws-backup-dashboards/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-AWS-Backup"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-west-1"
            }
        )
      + name               = "CloudWatch-oxygen-eu-west-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_notification.grafana_contact_point.this[0] will be created
  + resource "grafana_contact_point" "this" {
      + disable_provenance = false
      + id                 = (known after apply)
      + name               = "Cloud Engineering Slack"

      + slack {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 95 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dashboard_meta = [
      + {
          + title   = "1Password Adoption"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Scimbridge deployment - Prod"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "AWS Backup Metrics"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "AWS CNI Metrics"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "AWS subnet usage"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Blueprints RDS Adoption"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Cloud Engineering Adoption"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Cluster Capacity"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Cluster Health"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "EC2 Credits"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "EKS version"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Flux Cluster Stats"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Flux Control Plane"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Goldpinger"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Helm Exporter"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Kafka-exporter"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Kiosk"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Kubernetes Components"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "readiness / liveness probes in namespace"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "readiness / liveness probes"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Node Condition"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Node Sockets Used"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Priority class"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Prometheus Blackbox Exporter"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Selfservice -- Tagging Adoption"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "SelfService -- RDS Tagging Compliance"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Traefik - Blue/Green Deployment"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Traefik"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
      + {
          + title   = "Kubernetes/Tanzu/Velero"
          + uid     = (known after apply)
          + url     = (known after apply)
          + version = (known after apply)
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/atlantis-data/repos/dfds/grafana-cloud-objects/67/grafana-cloud-objects-platform-ws-01/environments/platform/grafana-cloud-objects-platform-ws-01.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/dfds/grafana-cloud-objects/67/grafana-cloud-objects-platform-ws-01/environments/platform/grafana-cloud-objects-platform-ws-01.tfplan"

time=2024-06-14T10:50:33Z level=info msg=Downloading Terraform configurations from file:///atlantis-data/repos/dfds/grafana-cloud-objects/67/grafana-cloud-objects-platform-ws-01 into /atlantis-data/repos/dfds/grafana-cloud-objects/67/grafana-cloud-objects-platform-ws-01/environments/platform/.terragrunt-cache/SerKOoxsI7Qzd_Rb8m6WMXXdS7c/zByhgNXMkd4dWXAOFSmmEg0XfN8
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d environments/platform -w grafana-cloud-objects-platform-ws-01`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.hellman.oxygen.dfds.cloud/lock?id=dfds%252Fgrafana-cloud-objects%252Fenvironments%252Fplatform%252Fgrafana-cloud-objects-platform-ws-01)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d environments/platform -w grafana-cloud-objects-platform-ws-01`
</details>
Plan: 95 to add, 0 to change, 0 to destroy.